package ru.steeshock.goosebumpsapp.model;

import ru.steeshock.goosebumpsapp.R;

public class BooksInfo {

    public static final int [] imagesCollection = {
            R.drawable.im_1,
            R.drawable.im_2,
            R.drawable.im_3,
            R.drawable.im_4,
            R.drawable.im_5,
            R.drawable.im_6,
            R.drawable.im_7,
            R.drawable.im_8,
            R.drawable.im_9,
            R.drawable.im_10,
            R.drawable.im_11,

    };

    public static final String [] booksNames = {
            "Игра в невидимку (1993)",
            "Пугало гуляет в полночь (1994)",
            "Нечто из подвала (1992)",
            "Смертельное фото (1992)",
            "Тайна кораллового рифа (1994)",
            "Дъявольская кровь (1992)",
            "Один день в парке ужасов (1994)",
            "Добро пожаловать в мертвый дом (1992)",
            "Уж-ж-жасные пчелы (1994)",
            "Проклятие гробницы фараона (1993)",
            "Лето кошмаров (1993)",

    };

    public static final String [] booksDescription = {
            "В свой день рождения Макс находит на чердаке необычный подарок — волшебное зеркало, способное делать человека невидимым. Макс и его друзья затевают игру в невидимку: «Вот меня видно, а вот не видно». Всё это ужасно забавно и интересно. Но постепенно Макс понимает, что теряет контроль над волшебством. С каждым разом он остаётся невидимым всё дольше и дольше. Игра в невидимку обернулась опасной забавой. Неужели Макс останется невидимым навечно?\n" +
                    "Осторожнее, читатель, — страх идёт по пятам!",
            "Джоди любит приезжать на ферму к дедушке. Ничего особенного интересного там нет, зато дедушка знает много страшных историй. А какие оладьи печет бабушка - объедение! Но в этом году на ферме все по-другому. Дедушка с бабушкой очень состарились. А на кукурузном поле происходит что-то непонятное. Если раньше там было одно пугало, то теперь их не меньше дюжины, и выглядят они жутковато. А однажды вечером Джоди увидела нечто совершенно невероятное. Ей показалось, что пугала оживают...",
            "Однажды брат и сестра Маргарет и Кассей стали замечать, что их отец слишком много времени проводит в подвале и запрещает им туда ходить. И, хотя отец - заядлый ботаник, детям всё это кажется очень подозрительным. С отцом происходят странные вещи, а однажды дети обнаружили, что у него из головы растут листья.",
            "Что-то не в порядке со старым фотоаппаратом, который Грег с друзьями нашли в заброшенном доме. Фотографии получились какие-то странные. Например, вместо новой машины на снимке получился вдребезги разбитый автомобиль. А потом отец Грега на самом деле попал в ужасную аварию! Но друзья Грега ему не поверили. Шери даже заставила его принести фотоаппарат на свой день рождения и сфотографировать её. Только Шери на фотографии не оказалось! Неужели она теперь исчезнет навсегда? Кто ещё станет жертвой этого дьявольского фотоаппарата?",
            "Билли и его сестра Шин проводят каникулы у своего дяди - доктора Дипа на большом исследовательском катере «Кассандра», вблизи одного из крошечных островков Карибского моря. Это место идеально для изучения тайн подводного мира, а Билли бредит приключениями... Рифы притягивают Билли словно магнит. Там так красиво... Издали они такие мирные и безмятежные. Но вскоре выясняется, что он на рифах не один. Что-то тёмное, с тускло проблескивающей крупной зеленоватой чешуёй таится под лазурной поверхностью воды. Что-то таинственное... Полурыба-получеловек...",
            "Эвану приходится переехать к своей глухой бабушке, пока его родители ищут квартиру. Он знакомится с девочкой по имени Энди. Однажды они заходят в магазин и обнаруживают странную банку, на которой написано: «Дьявольская кровь». Продавец отказывается продать детям банку, но те его упросили. Когда они показывают это глухой бабушке Эвана, та делает пассы над банкой, а затем отдаёт её Эвану. В банке оказывается странный зелёный комочек. Поскольку он хорошо отскакивает от твёрдых поверхностей, дети играют с ним. Но потом они начинают замечать, что в городе происходят странные вещи.",
            "Семья Моррис заблудилась в поисках зоопарка. По дороге они попадают в Кошмарию, страну оживших ночных ужасов. В ней почти нет посетителей, нет телефонов, а служители наряжены монстрами. Похоже, что здесь очень интересно. Правда, «Смертельный спуск» с горы что-то уж слишком опасен. А «Зеркальный дворец» вообще отбивает всякую охоту развлекаться. Все шутки в парке ужасов чересчур зловещие. Переходят всякие границы.",
            "Аманда и Джош переезжают с родителями на новое место – в большой мрачный дом, оставшийся их отцу в наследство от старого двоюродного дедушки, которого никто из них никогда не видел. Детям дом сразу не понравился. Похоже, в нём даже водятся привидения – Аманде все время мерещатся незнакомые мальчики и девочки, разгуливающие по всему дому.",
            "Гэри Лутцу совсем не везет в жизни. У него нет настоящих друзей, соседские парни не упускают случая поколотить его. Он боится пчёл, а у его соседа есть целая пасека. Единственный друг Гэри - компьютер. Однажды в интернете он нашёл предложение поменять своё тело на любое другое. Заинтриговавшись, Гэри соглашается. Однако во время перемещения в аппарат случайно попадает пчела.",
            "Гейб с родителями приехал в Египет, потому что там живёт его дядя Бен. Неожиданно родителям срочно надо ехать в Александрию, и Гейб остаётся в Каире с дядей Беном и его дочерью Сари. Дядя Бен знакомит Гейба с пирамидами. Сари предлагает Гейбу исследовать пирамиды самостоятельно. Они идут по коридорам, и неожиданно у Гейба развязывается шнурок. Наклонившись, чтобы его завязать, Гейб не сразу заметил, что Сари исчезла.",
            "Родители Билли, исследователи и учёные, отправляют его в лагерь. Автобус, который вёз детей в лагерь, уезжает, оставив детей и их вещи на дороге. За ними приходят вожатые и отводят в лагерь. Там одного мальчика жалит змея, а вожатые на это не обращают никакого внимания. Утром мальчик и его вещи таинственным образом исчезают. С того момента начинают происходить таинственные вещи, на которые не обращает внимания никто, кроме Билли.",

    };
}
