package ru.steeshock.goosebumpsapp.model;

import ru.steeshock.goosebumpsapp.R;

public class BooksInfo {

    public static final int [] imagesCollection = {
            R.drawable.im_1,
            R.drawable.im_2,
            R.drawable.im_3,
            R.drawable.im_4,
            R.drawable.im_5,
            R.drawable.im_6,
            R.drawable.im_7,
            R.drawable.im_8,
            R.drawable.im_9,
            R.drawable.im_10,
            R.drawable.im_11,
            R.drawable.im_12,
            R.drawable.im_13,
            R.drawable.im_14,
            R.drawable.im_15,
            R.drawable.im_16,
            R.drawable.im_17,
            R.drawable.im_18,
            R.drawable.im_19,
            R.drawable.im_20,
            R.drawable.im_20,
            R.drawable.im_20,
            R.drawable.im_20,
            R.drawable.im_20,
            R.drawable.im_20,

    };

    public static final String [] booksNames = {
            "Игра в невидимку (1993)",
            "Пугало гуляет в полночь (1994)",
            "Нечто из подвала (1992)",
            "Смертельное фото (1992)",
            "Тайна кораллового рифа (1994)",
            "Дъявольская кровь (1992)",
            "Один день в парке ужасов (1994)",
            "Добро пожаловать в мертвый дом (1992)",
            "Уж-ж-жасные пчелы (1994)",
            "Проклятие гробницы фараона (1993)",
            "Лето кошмаров (1993)",
            "Волшебство хрустального шара (1994)",
            "Смертельный урок музыки (1993)",
            "Оборотень из болот (1993)",
            "Самое жуткое приключение (1994)",
            "Ночь в башне ужаса (1995)",
            "Тайна часов с кукушкой (1995)",
            "Загадочная находка (1995)",
            "Улица страшных снов (1995)",
            "Легенда дремучего леса (1996)",
            "Как я научился летать (1997)",
            "Проклятие холодного озера (1997)",
            "Заклятие старой колдуньи (1997)",
            "Атака мутанта (1995)",
            "Страшная месть (1994)",


    };

    public static final String [] booksDescription = {
            "В свой день рождения Макс находит на чердаке необычный подарок — волшебное зеркало, способное делать человека невидимым. Макс и его друзья затевают игру в невидимку: «Вот меня видно, а вот не видно». Всё это ужасно забавно и интересно. Но постепенно Макс понимает, что теряет контроль над волшебством. С каждым разом он остаётся невидимым всё дольше и дольше. Игра в невидимку обернулась опасной забавой. Неужели Макс останется невидимым навечно?\n" + "Осторожнее, читатель, — страх идёт по пятам!",
            "Джоди любит приезжать на ферму к дедушке. Ничего особенного интересного там нет, зато дедушка знает много страшных историй. А какие оладьи печет бабушка - объедение! Но в этом году на ферме все по-другому. Дедушка с бабушкой очень состарились. А на кукурузном поле происходит что-то непонятное. Если раньше там было одно пугало, то теперь их не меньше дюжины, и выглядят они жутковато. А однажды вечером Джоди увидела нечто совершенно невероятное. Ей показалось, что пугала оживают...",
            "Однажды брат и сестра Маргарет и Кассей стали замечать, что их отец слишком много времени проводит в подвале и запрещает им туда ходить. И, хотя отец - заядлый ботаник, детям всё это кажется очень подозрительным. С отцом происходят странные вещи, а однажды дети обнаружили, что у него из головы растут листья.",
            "Что-то не в порядке со старым фотоаппаратом, который Грег с друзьями нашли в заброшенном доме. Фотографии получились какие-то странные. Например, вместо новой машины на снимке получился вдребезги разбитый автомобиль. А потом отец Грега на самом деле попал в ужасную аварию! Но друзья Грега ему не поверили. Шери даже заставила его принести фотоаппарат на свой день рождения и сфотографировать её. Только Шери на фотографии не оказалось! Неужели она теперь исчезнет навсегда? Кто ещё станет жертвой этого дьявольского фотоаппарата?",
            "Билли и его сестра Шин проводят каникулы у своего дяди - доктора Дипа на большом исследовательском катере «Кассандра», вблизи одного из крошечных островков Карибского моря. Это место идеально для изучения тайн подводного мира, а Билли бредит приключениями... Рифы притягивают Билли словно магнит. Там так красиво... Издали они такие мирные и безмятежные. Но вскоре выясняется, что он на рифах не один. Что-то тёмное, с тускло проблескивающей крупной зеленоватой чешуёй таится под лазурной поверхностью воды. Что-то таинственное... Полурыба-получеловек...",
            "Эвану приходится переехать к своей глухой бабушке, пока его родители ищут квартиру. Он знакомится с девочкой по имени Энди. Однажды они заходят в магазин и обнаруживают странную банку, на которой написано: «Дьявольская кровь». Продавец отказывается продать детям банку, но те его упросили. Когда они показывают это глухой бабушке Эвана, та делает пассы над банкой, а затем отдаёт её Эвану. В банке оказывается странный зелёный комочек. Поскольку он хорошо отскакивает от твёрдых поверхностей, дети играют с ним. Но потом они начинают замечать, что в городе происходят странные вещи.",
            "Семья Моррис заблудилась в поисках зоопарка. По дороге они попадают в Кошмарию, страну оживших ночных ужасов. В ней почти нет посетителей, нет телефонов, а служители наряжены монстрами. Похоже, что здесь очень интересно. Правда, «Смертельный спуск» с горы что-то уж слишком опасен. А «Зеркальный дворец» вообще отбивает всякую охоту развлекаться. Все шутки в парке ужасов чересчур зловещие. Переходят всякие границы.",
            "Аманда и Джош переезжают с родителями на новое место – в большой мрачный дом, оставшийся их отцу в наследство от старого двоюродного дедушки, которого никто из них никогда не видел. Детям дом сразу не понравился. Похоже, в нём даже водятся привидения – Аманде все время мерещатся незнакомые мальчики и девочки, разгуливающие по всему дому.",
            "Гэри Лутцу совсем не везет в жизни. У него нет настоящих друзей, соседские парни не упускают случая поколотить его. Он боится пчёл, а у его соседа есть целая пасека. Единственный друг Гэри - компьютер. Однажды в интернете он нашёл предложение поменять своё тело на любое другое. Заинтриговавшись, Гэри соглашается. Однако во время перемещения в аппарат случайно попадает пчела.",
            "Гейб с родителями приехал в Египет, потому что там живёт его дядя Бен. Неожиданно родителям срочно надо ехать в Александрию, и Гейб остаётся в Каире с дядей Беном и его дочерью Сари. Дядя Бен знакомит Гейба с пирамидами. Сари предлагает Гейбу исследовать пирамиды самостоятельно. Они идут по коридорам, и неожиданно у Гейба развязывается шнурок. Наклонившись, чтобы его завязать, Гейб не сразу заметил, что Сари исчезла.",
            "Родители Билли, исследователи и учёные, отправляют его в лагерь. Автобус, который вёз детей в лагерь, уезжает, оставив детей и их вещи на дороге. За ними приходят вожатые и отводят в лагерь. Там одного мальчика жалит змея, а вожатые на это не обращают никакого внимания. Утром мальчик и его вещи таинственным образом исчезают. С того момента начинают происходить таинственные вещи, на которые не обращает внимания никто, кроме Билли.",
            "Саманта Бёрд, высокая и неуклюжая девушка, постоянно подвергается насмешкам из-за своей фамилии (Бёрд в переводе с английского - птица). Она ходит на баскетбол, хотя и не умеет хорошо играть. Однажды она встречает на улице пожилую женщину Клариссу и помогает ей дойти до своего дома. За это Кларисса награждает Саманту тремя желаниями.",
            "Родители двенадцатилетнего Джерри переезжают в новый дом. На чердаке он обнаруживает старое пианино и решает научиться на нём играть. Однако по ночам Джерри слышит печальную музыку, а однажды он спустился и обнаружил, что на пианино играет женщина-призрак. Родители нанимают Джерри учителя мистера Визка, который учит его играть на пианино. Однако учитель какой-то странный: он обращает внимание только на руки Джерри. И действительно, с руками Джерри начинается творится что-то странное.",
            "Грэди и его сестра Эмили переехали в новый дом. Их отец держит в загоне оленя, чтобы выяснить, сможет ли он выжить, если его выпустить на волю. Грэди и Эмили гуляют по лесу, однако один раз они обнаружили, что заблудились. Они находят хижину старого отшельника, который прогоняет их. Вскоре Грэди кусает собака, а на местном болоте находят растерзанных птиц.",
            "Ларри Бойд нашёл в мусорном баке классную штуку – старый флакон с надписью «Мгновенный загар». На этикетке значилось: «Втирая это средство в кожу, вы приобретете бронзовый загар за считанные минуты!» Так и сделали Ларри и его друзья, но загар у них не появился. Ничего не вышло. По крайней мере, так думал Ларри, пока не заметил волоски. Темные, колючие волоски, покрывавшие ладони и лицо. Точнее, не волоски, а блестящую чёрную шерсть. После каждого бритья шерсть вырастала ещё быстрее.",
            "Сью и Эдди вместе с экскурсоводом исследуют таинственную башню, откуда в Средние века непонятным образом пропали два человека. Дети теряют экскурсовода и пытаются выбраться, однако их преследует странный человек с топором. Когда же они выбираются, то обнаруживают, что информации об их родителях нигде нет. Да и самих родителей они не помнят.",
            "Майкл Вебстер ненавидит свою сестру Тару за то, что та постоянно пакостит ему. Однажды родители покупают часы с кукушкой в антикварном магазине. Ночью Майкл тайно пробирается к ним и сворачивает голову кукушке. И - странное дело - время начинает идти назад.",
            "Кэт с братом Дэниэлом переехали в новый дом. Кэт нашла под раковиной странную губку, которая пульсировала, будто была жива. Когда Кэт продемонстрировала находку папе, тот упал с лестницы. А губка запульсировала ещё сильнее.",
            "Эрин Райт и её друг Марти обожают фильмы ужасов. Особенно «Улицу кошмаров» - про разных монстров. Но когда Марти и Эрин отправились на экскурсию по киностудии, где снимают \"Улицу кошмаров\", они испугались не на шутку.",
            "Папа у Джастина – знаменитый писатель. Он много ездит по миру в поисках интересных историй, собирает древние легенды и пишет сказки. Вот и на этот раз он отправился в Брованию и взял с собой сына Джастина и дочь Мариссу. Они решили отыскать таинственную древнюю рукопись под названием Легенда дремучего леса. Никто не знает, о чём говорится в легенде. Рукопись потерялась пятьсот лет назад. Джастин с Мариссой очень хотели помочь отцу. Но рукопись они не нашли, зато потерялись сами. Заблудились в дремучих лесах Бровании, где обитают странные существа: миллионы писклявых мышей, собака с серебряной шерстью и суровые викинги из далекого прошлого.",
            "Вилсон Шламм был единственной причиной неудач Джека Джонсона. И Джеку приходилось терпеть это. Вот почему он оказался на пляже, в старом, жутком, заброшенном доме. В полной темноте. Пытаясь быть подальше от Вилсона. Вот тогда-то жизнь Джека круто изменилась. Он нашёл замечательную книгу «Уроки полетов». В ней объяснялось, как человек может научиться летать. Бедняжка Джек. Он хотел всего лишь отомстить Вилсону. Но теперь, когда он научился летать, события, происходящие на земле, стали принимать неожиданный оборот.",
            "Сара приезжает в летний лагерь. Из-за нескольких неловких недоразумений её ненавидит весь лагерь. И тогда Сара решила сделать вид, что утонула, чтобы все её жалели и уважали. Однако вскоре Сара поняла, что не следовало ей этого делать, ведь на самом дне озера обитало странное существо.",
            "Все жители Гошен-Фоллс считают Ванессой колдуньей. Она одевается во всё чёрное. Красит губы чёрной помадой. И может заколдовать любого - по крайней мере, так говорят. Кристал и её брату Коулу было давно известно: нельзя верить тому, что говорят люди. Но рассказам о Ванессе они поверили после того, как случайно рассердили её и услышали странные слова: «Цыпа-цыпа!» С тех пор с ними стало происходить нечто ужасное. Губы Кристал затвердели, как птичий клюв, а у Коула начали расти уродливые белые перья.",
            "Скиппер Мэтьюз собрал замечательную коллекцию комиксов. Его любимый комикс «Мутант в маске» рассказывал о злодее, который стремился покорить Вселенную. Скиппер взахлёб читал о приключениях Мутанта - до тех пор, пока однажды вдруг не оказался в незнакомом районе города и не увидел здание, точную копию тайного убежища Мутанта.",
            "Тодд увлекается червями? Не то слово - он так очарован ими, что устроил для них в подвале ферму! Больше всего Тодду нравится пугать ими свою сестру и её подругу. Он бросает червей им в волосы, засовывает за шиворот. Но однажды, разрезав червя пополам, Тодд заметил нечто странное. Все черви, казалось, пристально наблюдают за ним! Вдруг Тодд стал обнаруживать червей в самых неожиданных местах: в постели, в школьной тетради… Даже в бутерброде! Что делать любителю червей, когда собственные черви начинают одолевать его?",


    };

    public static final String [] booksPaths = {
            "book_1.pdf",
    };
}
